
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user network, expiring 30 Jun 2025
Serial number: 401809303522
  Licensed to: Victor Ortega
               UNAM

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do "enighdata.do" 

. *************************************************
. ***************** Clean Memory ******************
. *************************************************
. 
. clear

. cap clear

. cap log close

. set more off

. 
. *************************************************
. **************** Define Globals *****************
. *************************************************
. 
. global project="/Users/victorortega/Dropbox/mw_ethnic/downloaddata/output"

. global output="/Users/victorortega/Dropbox/mw_ethnic/enighdata/output"

. 
. *** REPLICATION FILE: enighdata
. *** STATA VERSION: 18/SE
. *** AUTHOR: Victor Alfonso Ortega Le Hénanff
. *** EMAIL: vincictor33@gmail.com
. *** DATE: 2025-02-16
. 
. *************************************************
. ************** 2016 ENIGH dataset ***************
. *************************************************
. 
. tempfile deflators

. import delimited using "../input/inpc.csv", clear varnames(1)
(encoding automatically selected: UTF-8)
(1 var, 84 obs)

. gen year = 2016 + int((_n-1)/12)

. gen month = mod(_n-1, 12) + 1

. gen mes = string(month)

. replace mes = "0" + mes if month < 10
(63 real changes made)

. gen time = date(string(year) + "-" + mes, "YM")

. format time %td

. drop year month mes

. save `deflators'
file /var/folders/ym/ly4nlkxs5_3dmz2_2h7wxvr80000gn/T//St26292.000001 saved
    as .dta format

. 
. *************************************************
. ************** 2016 ENIGH dataset ***************
. *************************************************
. 
. ******** Poblacion and concentradohogar *********
. 
. use "../input/poblacion2016.dta", clear

. *use "$project/poblacion2016.dta", clear
. egen new_id = concat(folioviv foliohog numren)

. keep new_id hablaind lenguaind comprenind etnia sexo edad madre_hog padre_hog
>  asis_esc nivelaprob gradoaprob residencia hor_1 trabajo_mp 

. tempfile pop_data_2016

. save `pop_data_2016'
file /var/folders/ym/ly4nlkxs5_3dmz2_2h7wxvr80000gn/T//St26292.000002 saved
    as .dta format

. 
. use "../input/concentradohogar2016.dta", clear

. *use "$project/concentradohogar2016.dta", clear
. collapse (first) ubica_geo, by(folioviv)

. tempfile hog_data_2016

. save `hog_data_2016'
file /var/folders/ym/ly4nlkxs5_3dmz2_2h7wxvr80000gn/T//St26292.000003 saved
    as .dta format

. 
. ************ Ingresos ENIGH dataset *************
. 
. use "../input/ingresos2016.dta", clear

. *use "$project/ingresos2016.dta", clear
. egen new_id = concat(folioviv foliohog numren)

. 
. gen clave_group = ""
(334,337 missing values generated)

. 
. *https://www.inegi.org.mx/rnm/index.php/catalog/685/data-dictionary
. *The previous link is the source for ALL of the following data cleanup.
. 
. /*Wages*/
. replace clave_group = "wages" if inlist(clave, "P001", "P002", "P011", "P018"
> , "P019", "P067")
variable clave_group was str1 now str5
(87,634 real changes made)

. 
. /*Non Wage Labor Income*/
. replace clave_group = "non_wage_income" if inlist(clave, "P003", "P004", "P00
> 5", "P006", "P007", "P009")
variable clave_group was str5 now str15
(67,059 real changes made)

. replace clave_group = "non_wage_income" if inlist(clave, "P008","P014","P015"
> ,"P016")
(17,987 real changes made)

. 
. /*Government Transfers*/
. replace clave_group = "gov_transfers" if inlist(clave, "P032","P033","P038","
> P040","P042","P043","P044","P045") 
(78,525 real changes made)

. replace clave_group = "gov_transfers" if inlist(clave, "P048","P101","P046","
> P047","P102","P103")
(3,297 real changes made)

. replace clave_group = "gov_transfers" if inlist(clave, "P104","P105","P106","
> P107","P108")
(0 real changes made)

. 
. /*Other*/
. replace clave_group = "other" if inlist(clave, "P012","P013","P020","P021","P
> 022","P034","P035","P036","P037")
(23,196 real changes made)

. replace clave_group = "other" if inlist(clave, "P041","P049","P051","P057","P
> 058","P039")
(15,084 real changes made)

.         
. /*Rents*/
. replace clave_group = "rentas" if inlist(clave, "P023","P024","P025")
(2,757 real changes made)

. 
. /*Financial Capital*/
. replace clave_group = "fin_capital" if inlist(clave, "P026","P027","P028","P0
> 29","P030","P031","P050")
(703 real changes made)

. replace clave_group = "fin_capital" if inlist(clave, "P065","P066","P052","P0
> 53","P064")
(6,970 real changes made)

. 
. /*Business Income*/
. replace clave_group = "negocio" if inlist(clave, "P068","P069","P070","P071",
> "P072","P073","P074")  
(22,540 real changes made)

. replace clave_group = "negocio" if inlist(clave, "P078","P079","P080","P081",
> "P075","P076","P077")
(4,699 real changes made)

. 
. /*Sales*/
. replace clave_group = "ventas" if inlist(clave, "P054","P055","P056","P059","
> P060","P061","P062","P063")
(3,886 real changes made)

. 
. *Collapse income by our new six income classes
. collapse (sum) ing_1 ing_2 ing_3 ing_4 ing_5 ing_6 (first) mes_1 mes_2 mes_3 
> mes_4 mes_5 mes_6, by(new_id clave_group)

. 
. * Replace spaces with the value from the other row with the same new_id
. foreach mes in mes_1 mes_2 mes_3 mes_4 mes_5 mes_6 {
  2.     replace `mes' = `mes'[_n-1] if `mes' == " " & new_id == new_id[_n-1]
  3.     replace `mes' = `mes'[_n+1] if `mes' == " " & new_id == new_id[_n+1]
  4. }
(4,109 real changes made)
(26,970 real changes made)
(4,109 real changes made)
(26,970 real changes made)
(4,109 real changes made)
(26,970 real changes made)
(4,109 real changes made)
(26,970 real changes made)
(4,109 real changes made)
(26,970 real changes made)
(4,109 real changes made)
(26,970 real changes made)

. 
. *Create a panel dataset
. reshape long ing_, i(new_id clave_group) j(month)
(j = 1 2 3 4 5 6)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations          279,789   ->   1,678,734   
Number of variables                  14   ->   10          
j variable (6 values)                     ->   month
xij variables:
                  ing_1 ing_2 ... ing_6   ->   ing_
-----------------------------------------------------------------------------

. gen mes = ""
(1,678,734 missing values generated)

. 
. * Loop through the months and assign the value from mes_1, mes_2, mes_3...
. foreach m of numlist 1/6 {
  2.     replace mes = mes_`m' if month == `m'
  3. }
variable mes was str1 now str2
(279,789 real changes made)
(279,789 real changes made)
(279,789 real changes made)
(279,789 real changes made)
(279,789 real changes made)
(279,789 real changes made)

. 
. drop month mes_1 mes_2 mes_3 mes_4 mes_5

. 
. gen ing_wages = ing_ if clave_group == "wages"
(1,155,822 missing values generated)

. gen ing_non_wage_income = ing_ if clave_group == "non_wage_income"
(1,387,560 missing values generated)

. gen ing_fin_capital = ing_ if clave_group == "fin_capital"
(1,634,202 missing values generated)

. gen ing_gov_transfers = ing_ if clave_group == "gov_transfers"
(1,250,706 missing values generated)

. gen ing_negocio = ing_ if clave_group == "negocio"
(1,532,040 missing values generated)

. gen ing_other = ing_ if clave_group == "other"
(1,472,538 missing values generated)

. gen ing_rentas = ing_ if clave_group == "rentas"
(1,662,372 missing values generated)

. gen ing_ventas = ing_ if clave_group == "ventas"
(1,655,898 missing values generated)

. 
. collapse (max) ing_wages ing_non_wage_income ing_fin_capital ing_gov_transfer
> s ing_negocio ing_other ing_rentas ing_ventas, by(new_id mes mes_6)

. 
. *drop mes_6 (was our sanity check)
. drop mes_6

. 
. ************ Merge with previous datasets *************
. 
. merge m:1 new_id using `pop_data_2016'

    Result                      Number of obs
    -----------------------------------------
    Not matched                        82,686
        from master                         0  (_merge==1)
        from using                     82,686  (_merge==2)

    Matched                         1,050,277  (_merge==3)
    -----------------------------------------

. drop _merge

. gen folioviv = substr(new_id, 1, length(new_id) - 3)

. 
. merge m:1 folioviv using `hog_data_2016', keepusing(ubica_geo)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                         1,132,963  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. ************ Data cleanup for estimation *************
. 
. sort new_id mes

. 
. *generate date
. gen time = date("2016-" + mes, "YM")
(82,777 missing values generated)

. format time %td

. order time, after(mes)

. label variable time "month year date"

. drop mes

. 
. *generate gender
. gen gender = .
(1,132,963 missing values generated)

. replace gender = 1 if sexo == "1"
(590,558 real changes made)

. replace gender = 0 if sexo == "2"
(542,405 real changes made)

. label define genderlbl 1 "Male" 0 "Female"

. label values gender genderlbl

. order gender, after(sexo)

. label variable gender "gender"

. label variable edad "age"

. order gender edad, after(time)

. drop sexo

. 
. *mother and father home
. gen motherhome = .
(1,132,963 missing values generated)

. replace motherhome = 1 if madre_hog == "1"
(417,347 real changes made)

. replace motherhome = 0 if madre_hog == "2"
(715,616 real changes made)

. label define motherlbl 1 "Yes" 0 "No"

. label values motherhome motherlbl

. order motherhome, after(madre_hog)

. label variable motherhome "lives with mother"

. drop madre_hog

. gen fatherhome = .
(1,132,963 missing values generated)

. replace fatherhome = 1 if padre_hog == "1"
(304,505 real changes made)

. replace fatherhome = 0 if padre_hog == "2"
(828,458 real changes made)

. label define fatherlbl 1 "Yes" 0 "No"

. label values fatherhome fatherlbl

. order fatherhome, before(motherhome)

. label variable fatherhome "lives with father"

. drop padre_hog

. 
. *indigenous language speaker
. gen indspeaker = .
(1,132,963 missing values generated)

. replace indspeaker = 1 if hablaind == "1"
(84,663 real changes made)

. replace indspeaker = 0 if hablaind == "2"
(1,030,442 real changes made)

. label define indspeakerlbl 1 "Yes" 0 "No"

. label values indspeaker indspeakerlbl

. order indspeaker, before(hablaind)

. label variable indspeaker "speaks indigenous language"

. drop hablaind

. 
. *indigenous language 
. rename lenguaind indlang

. label variable indlang "indigenous language spoken"

. destring indlang, replace
indlang: all characters numeric; replaced as int
(1048300 missing values generated)

. label define indlanglbl ///
>     111 "Paipai" ///
>     112 "Kiliwa" ///
>     115 "Kumiai" ///
>     131 "Chontal de Oaxaca" ///
>     200 "Chinanteco" ///
>     211 "Chinanteco de Ojitlán" ///
>     212 "Chinanteco de Usila" ///
>     222 "Chinanteco de Yolox" ///
>     223 "Chinanteco de Sochiapan" ///
>     231 "Chinanteco de Palantla" ///
>     232 "Chinanteco de Valle Nacional" ///
>     241 "Chinanteco de Lalana" ///
>     243 "Unknown" ///
>     311 "Pame" ///
>     321 "Chichimeca Jonaz" ///
>     331 "Otomí" ///
>     332 "Mazahua" ///
>     342 "Ocuilteco" ///
>     400 "Zapoteco" ///
>     411 "Zapoteco de Ixtlán" ///
>     412 "Zapoteco Vijano" ///
>     421 "Zapoteco Vallista" ///
>     422 "Zapoteco del Istmo" ///
>     431 "Zapoteco de Cuixtla" ///
>     432 "Solteco" ///
>     433 "Zapoteco Sureño" ///
>     441 "Chatino" ///
>     450 "Mixteco" ///
>     451 "Mixteco Zona Costa" ///
>     452 "Mixteco Zona Alta" ///
>     453 "Mixteco Zona Baja" ///
>     454 "Mixteco Zona Mazateca" ///
>     455 "Mixteco de Puebla" ///
>     456 "Tacuate" ///
>     461 "Cuicateco" ///
>     471 "Triqui" ///
>     481 "Amuzgo" ///
>     482 "Amuzgo de Guerrero" ///
>     483 "Amuzgo de Oaxaca" ///
>     491 "Mazateco" ///
>     493 "Ixcateco" ///
>     494 "Popoloca" ///
>     511 "Huave" ///
>     611 "Tlapaneco" ///
>     711 "Totonaca" ///
>     712 "Tepehua" ///
>     800 "Popoluca" ///
>     811 "Mixe" ///
>     812 "Popoluca de Oluta" ///
>     821 "Popoluca de la Sierra" ///
>     822 "Popoluca de Texistepec" ///
>     823 "Zoque" ///
>     911 "Huasteco" ///
>     921 "Lacandón" ///
>     922 "Maya" ///
>     931 "Ch'ol" ///
>     932 "Chontal de Tabasco" ///
>     933 "Tzeltal" ///
>     934 "Tzotzil" ///
>     935 "Tojolabal" ///
>     936 "Chuj" ///
>     941 "Mame" ///
>     942 "Ixil" ///
>     943 "Aguacateco" ///
>     951 "Motocintleco" ///
>     961 "Kanjobal" ///
>     971 "Quiché" ///
>     972 "Cakchiquel" ///
>     981 "Kekchi" ///
>     1011 "Pima" ///
>     1012 "Pápago" ///
>     1013 "Tepehuano" ///
>     1014 "Tepehuano del Norte" ///
>     1015 "Tepehuano del Sur" ///
>     1021 "Tarahumara" ///
>     1022 "Mayo" ///
>     1023 "Yaqui" ///
>     1024 "Guarijío" ///
>     1031 "Cora" ///
>     1032 "Huichol" ///
>     1041 "Náhuatl" ///
>     1111 "Purépecha" ///
>     1211 "Kikapú" ///
>     1311 "Chontal" ///
>     1999 "No especificado" ///
>     5024 "Chiapaneco" ///
>     5063 "Huzco" ///
>     5103 "Tehueco" ///
>     5501 "Añu" ///
>     5540 "Guajiro" ///
>     5571 "Pipil" ///
>     5595 "Wayuu"

. label values indlang indlanglbl

. 
. *understands indigenous language 
. gen indund = .
(1,132,963 missing values generated)

. replace indund = 1 if comprenind == "1"
(29,880 real changes made)

. replace indund = 0 if comprenind == "2"
(1,000,562 real changes made)

. label define indundlbl 0 "No" 1 "Yes"

. label values indund indundlbl

. order indund, before(comprenind)

. label variable indund "understands indigenous language"

. drop comprenind

. 
. *indigenous self-identification 
. gen indigenous = .
(1,132,963 missing values generated)

. replace indigenous = 1 if etnia == "1"
(370,389 real changes made)

. replace indigenous = 0 if etnia == "2"
(744,715 real changes made)

. label define indigenouslbl 0 "No" 1 "Yes"

. label values indigenous indigenouslbl

. order indigenous, before(etnia)

. label variable indigenous "indigenous self-identification"

. drop etnia

. 
. *school attendance
. gen school_attendance = .
(1,132,963 missing values generated)

. replace school_attendance = 1 if asis_esc == "1"
(256,170 real changes made)

. replace school_attendance = 0 if asis_esc == "2"
(858,935 real changes made)

. label define school_attendlbl 0 "No" 1 "Yes"

. label values school_attendance school_attendlbl

. order school_attendance, before(asis_esc)

. label variable school_attendance "school attendance"

. drop asis_esc

. 
. *years of school achieved
. *we assume that masters goes after a 5 year college education
. gen years_of_study = .
(1,132,963 missing values generated)

. replace years_of_study = 0 if nivelaprob == "0"
(67,833 real changes made)

. replace years_of_study = 0 if nivelaprob == "1"
(30,054 real changes made)

. replace years_of_study = 1 if nivelaprob == "2" & gradoaprob == "1"
(32,011 real changes made)

. replace years_of_study = 2 if nivelaprob == "2" & gradoaprob == "2"
(43,476 real changes made)

. replace years_of_study = 3 if nivelaprob == "2" & gradoaprob == "3"
(58,289 real changes made)

. replace years_of_study = 4 if nivelaprob == "2" & gradoaprob == "4"
(35,706 real changes made)

. replace years_of_study = 5 if nivelaprob == "2" & gradoaprob == "5"
(32,815 real changes made)

. replace years_of_study = 6 if nivelaprob == "2" & gradoaprob == "6"
(156,031 real changes made)

. replace years_of_study = 7 if nivelaprob == "3" & gradoaprob == "1"
(28,813 real changes made)

. replace years_of_study = 8 if nivelaprob == "3" & gradoaprob == "2"
(40,018 real changes made)

. replace years_of_study = 9 if nivelaprob == "3" & gradoaprob == "3"
(246,101 real changes made)

. replace years_of_study = 10 if nivelaprob == "4" & gradoaprob == "1"
(28,972 real changes made)

. replace years_of_study = 11 if nivelaprob == "4" & gradoaprob == "2"
(30,372 real changes made)

. replace years_of_study = 12 if nivelaprob == "4" & gradoaprob == "3"
(110,880 real changes made)

. replace years_of_study = 13 if nivelaprob == "5" & gradoaprob == "1"
(230 real changes made)

. replace years_of_study = 14 if nivelaprob == "5" & gradoaprob == "2"
(290 real changes made)

. replace years_of_study = 15 if nivelaprob == "5" & gradoaprob == "3"
(1,281 real changes made)

. replace years_of_study = 16 if nivelaprob == "5" & gradoaprob == "4"
(4,247 real changes made)

. replace years_of_study = 17 if nivelaprob == "5" & gradoaprob == "5"
(1,014 real changes made)

. replace years_of_study = 13 if nivelaprob == "6" & gradoaprob == "1"
(2,384 real changes made)

. replace years_of_study = 14 if nivelaprob == "6" & gradoaprob == "2"
(8,763 real changes made)

. replace years_of_study = 15 if nivelaprob == "6" & gradoaprob == "3"
(20,689 real changes made)

. replace years_of_study = 16 if nivelaprob == "6" & gradoaprob == "4"
(1,808 real changes made)

. replace years_of_study = 17 if nivelaprob == "6" & gradoaprob == "5"
(0 real changes made)

. replace years_of_study = 13 if nivelaprob == "7" & gradoaprob == "1"
(12,031 real changes made)

. replace years_of_study = 14 if nivelaprob == "7" & gradoaprob == "2"
(12,381 real changes made)

. replace years_of_study = 15 if nivelaprob == "7" & gradoaprob == "3"
(13,990 real changes made)

. replace years_of_study = 16 if nivelaprob == "7" & gradoaprob == "4"
(39,943 real changes made)

. replace years_of_study = 17 if nivelaprob == "7" & gradoaprob == "5"
(42,710 real changes made)

. replace years_of_study = 18 if nivelaprob == "8" & gradoaprob == "1"
(878 real changes made)

. replace years_of_study = 19 if nivelaprob == "8" & gradoaprob == "2"
(6,567 real changes made)

. replace years_of_study = 20 if nivelaprob == "8" & gradoaprob == "3"
(1,851 real changes made)

. replace years_of_study = 21 if nivelaprob == "9" & gradoaprob == "1"
(619 real changes made)

. replace years_of_study = 22 if nivelaprob == "9" & gradoaprob == "2"
(603 real changes made)

. replace years_of_study = 23 if nivelaprob == "9" & gradoaprob == "3"
(537 real changes made)

. replace years_of_study = 24 if nivelaprob == "9" & gradoaprob == "4"
(230 real changes made)

. replace years_of_study = 25 if nivelaprob == "9" & gradoaprob == "5"
(97 real changes made)

. label variable years_of_study "years of study"

. order years_of_study, after(school_attendance)

. drop nivelaprob gradoaprob

. 
. *generate state
. drop residencia

. gen state = substr(ubica_geo, 1, 2)

. destring state, replace
state: all characters numeric; replaced as byte

. label define states ///
>         1 "Aguascalientes" ///
>         2 "Baja California" ///
>         3 "Baja California Sur" ///
>         4 "Campeche" ///
>         5 "Coahuila" ///
>         6 "Colima" ///
>         7 "Chiapas" ///
>         8 "Chihuahua" ///
>         9 "Ciudad de México" ///
>         10 "Durango" ///
>         11 "Guanajuato" ///
>         12 "Guerrero" ///
>         13 "Hidalgo" ///
>         14 "Jalisco" ///
>         15 "México" ///
>         16 "Michoacán" ///
>         17 "Morelos" ///
>         18 "Nayarit" ///
>         19 "Nuevo León" ///
>         20 "Oaxaca" ///
>         21 "Puebla" ///
>         22 "Querétaro" ///
>         23 "Quintana Roo" ///
>         24 "San Luis Potosí" ///
>         25 "Sinaloa" ///
>         26 "Sonora" ///
>         27 "Tabasco" ///
>         28 "Tamaulipas" ///
>         29 "Tlaxcala" ///
>         30 "Veracruz" ///
>         31 "Yucatán" ///
>         32 "Zacatecas"

. 
. label values state states

. label variable state "state"

. label variable ubica_geo "municipality"

. label variable new_id "id"

. order ubica_geo state, after(new_id)

. 
. *work hours and employment dummy
. rename hor_1 hoursworked

. label variable hoursworked "hours worked per week"

. gen employed = .
(1,132,963 missing values generated)

. replace employed = 1 if trabajo_mp == "1"
(696,983 real changes made)

. replace employed = 0 if trabajo_mp == "2"
(297,979 real changes made)

. label define employedlbl 0 "No" 1 "Yes"

. label values employed employedlbl

. drop trabajo_mp

. label variable employed "employed previous month"

. drop folioviv

. 
. *income labels
. label variable ing_wages "wage income"

. label variable ing_non_wage_income "non wage labor income"

. label variable ing_gov_transfers "government transfer income"

. label variable ing_other "unclassified income"

. label variable ing_rentas "rental income"

. label variable ing_fin_capital "financial capital income"

. label variable ing_negocio "business income"

. label variable ing_ventas "sales income"

. 
. *clean id - we have 257,805 unique people in this dataset!
. egen id = group(new_id)

. order id, before(new_id)

. 
. *clean ubica_geo
. replace ubica_geo = substr(ubica_geo, 1, length(ubica_geo) - 4)
(1,132,963 real changes made)

. 
. *tempfile for append later
. tempfile enighdata2016

. save `enighdata2016'
file /var/folders/ym/ly4nlkxs5_3dmz2_2h7wxvr80000gn/T//St26292.000004 saved
    as .dta format

. 
. *************************************************
. ************** 2018 ENIGH dataset ***************
. *************************************************
. 
. ******** Poblacion and concentradohogar *********
. 
. use "../input/poblacion2018.dta", clear

. *use "$project/poblacion2018.dta", clear
. egen new_id = concat(folioviv foliohog numren)

. keep new_id hablaind lenguaind comprenind etnia sexo edad madre_hog padre_hog
>  asis_esc nivelaprob gradoaprob residencia hor_1 trabajo_mp 

. tempfile pop_data_2018

. save `pop_data_2018'
file /var/folders/ym/ly4nlkxs5_3dmz2_2h7wxvr80000gn/T//St26292.000005 saved
    as .dta format

. 
. use "../input/concentradohogar2018.dta", clear

. *use "$project/concentradohogar2018.dta", clear
. collapse (first) ubica_geo, by(folioviv)

. tempfile hog_data_2018

. save `hog_data_2018'
file /var/folders/ym/ly4nlkxs5_3dmz2_2h7wxvr80000gn/T//St26292.000006 saved
    as .dta format

. 
. ************ Ingresos ENIGH dataset *************
. 
. use "../input/ingresos2018.dta", clear

. *use "$project/ingresos2018.dta", clear
. egen new_id = concat(folioviv foliohog numren)

. 
. gen clave_group = ""
(348,487 missing values generated)

. 
. /*Wages*/
. replace clave_group = "wages" if inlist(clave, "P001", "P002", "P011", "P018"
> , "P019", "P067")
variable clave_group was str1 now str5
(93,476 real changes made)

. 
. /*Non Wage Labor Income*/
. replace clave_group = "non_wage_income" if inlist(clave, "P003", "P004", "P00
> 5", "P006", "P007", "P009")
variable clave_group was str5 now str15
(69,223 real changes made)

. replace clave_group = "non_wage_income" if inlist(clave, "P008","P014","P015"
> ,"P016")
(19,151 real changes made)

. 
. /*Government Transfers*/
. replace clave_group = "gov_transfers" if inlist(clave, "P032","P033","P038","
> P040","P042","P043","P044","P045") 
(80,989 real changes made)

. replace clave_group = "gov_transfers" if inlist(clave, "P048","P101","P046","
> P047","P102","P103")
(1,523 real changes made)

. replace clave_group = "gov_transfers" if inlist(clave, "P104","P105","P106","
> P107","P108")
(0 real changes made)

. 
. /*Other*/
. replace clave_group = "other" if inlist(clave, "P012","P013","P020","P021","P
> 022","P034","P035","P036","P037")
(22,881 real changes made)

. replace clave_group = "other" if inlist(clave, "P041","P049","P051","P057","P
> 058","P039")
(16,921 real changes made)

.         
. /*Rents*/
. replace clave_group = "rentas" if inlist(clave, "P023","P024","P025")
(2,968 real changes made)

. 
. /*Financial Capital*/
. replace clave_group = "fin_capital" if inlist(clave, "P026","P027","P028","P0
> 29","P030","P031","P050")
(704 real changes made)

. replace clave_group = "fin_capital" if inlist(clave, "P065","P066","P052","P0
> 53","P064")
(7,086 real changes made)

. 
. /*Business Income*/
. replace clave_group = "negocio" if inlist(clave, "P068","P069","P070","P071",
> "P072","P073","P074")  
(24,275 real changes made)

. replace clave_group = "negocio" if inlist(clave, "P078","P079","P080","P081",
> "P075","P076","P077")
(5,173 real changes made)

. 
. /*Sales*/
. replace clave_group = "ventas" if inlist(clave, "P054","P055","P056","P059","
> P060","P061","P062","P063")
(4,117 real changes made)

. 
. *Collapse income by our new six income classes
. collapse (sum) ing_1 ing_2 ing_3 ing_4 ing_5 ing_6 (first) mes_1 mes_2 mes_3 
> mes_4 mes_5 mes_6, by(new_id clave_group)

. 
. * Replace spaces with the value from the other row with the same new_id
. foreach mes in mes_1 mes_2 mes_3 mes_4 mes_5 mes_6 {
  2.     replace `mes' = `mes'[_n-1] if `mes' == " " & new_id == new_id[_n-1]
  3.     replace `mes' = `mes'[_n+1] if `mes' == " " & new_id == new_id[_n+1]
  4. }
(4,254 real changes made)
(28,963 real changes made)
(4,254 real changes made)
(28,963 real changes made)
(4,254 real changes made)
(28,963 real changes made)
(4,254 real changes made)
(28,963 real changes made)
(4,254 real changes made)
(28,963 real changes made)
(4,254 real changes made)
(28,963 real changes made)

. 
. *Create a panel dataset
. reshape long ing_, i(new_id clave_group) j(month)
(j = 1 2 3 4 5 6)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations          291,890   ->   1,751,340   
Number of variables                  14   ->   10          
j variable (6 values)                     ->   month
xij variables:
                  ing_1 ing_2 ... ing_6   ->   ing_
-----------------------------------------------------------------------------

. gen mes = ""
(1,751,340 missing values generated)

. 
. * Loop through the months and assign the value from mes_1, mes_2, mes_3...
. foreach m of numlist 1/6 {
  2.     replace mes = mes_`m' if month == `m'
  3. }
variable mes was str1 now str2
(291,890 real changes made)
(291,890 real changes made)
(291,890 real changes made)
(291,890 real changes made)
(291,890 real changes made)
(291,890 real changes made)

. 
. drop month mes_1 mes_2 mes_3 mes_4 mes_5

. 
. gen ing_wages = ing_ if clave_group == "wages"
(1,193,550 missing values generated)

. gen ing_non_wage_income = ing_ if clave_group == "non_wage_income"
(1,445,928 missing values generated)

. gen ing_fin_capital = ing_ if clave_group == "fin_capital"
(1,706,178 missing values generated)

. gen ing_gov_transfers = ing_ if clave_group == "gov_transfers"
(1,320,042 missing values generated)

. gen ing_negocio = ing_ if clave_group == "negocio"
(1,594,164 missing values generated)

. gen ing_other = ing_ if clave_group == "other"
(1,538,508 missing values generated)

. gen ing_rentas = ing_ if clave_group == "rentas"
(1,733,712 missing values generated)

. gen ing_ventas = ing_ if clave_group == "ventas"
(1,727,298 missing values generated)

. 
. collapse (max) ing_wages ing_non_wage_income ing_fin_capital ing_gov_transfer
> s ing_negocio ing_other ing_rentas ing_ventas, by(new_id mes mes_6)

. 
. *drop mes_6 (was our sanity check)
. drop mes_6

. 
. ************ Merge with previous datasets *************
. 
. merge m:1 new_id using `pop_data_2018'

    Result                      Number of obs
    -----------------------------------------
    Not matched                        86,772
        from master                         0  (_merge==1)
        from using                     86,772  (_merge==2)

    Matched                         1,094,206  (_merge==3)
    -----------------------------------------

. drop _merge

. gen folioviv = substr(new_id, 1, length(new_id) - 3)

. 
. merge m:1 folioviv using `hog_data_2018', keepusing(ubica_geo)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                         1,180,978  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. ************ Data cleanup for estimation *************
. 
. sort new_id mes

. 
. *generate date
. gen time = date("2018-" + mes, "YM")
(86,854 missing values generated)

. format time %td

. order time, after(mes)

. label variable time "month year date"

. drop mes

. 
. *generate gender
. gen gender = .
(1,180,978 missing values generated)

. replace gender = 1 if sexo == "1"
(617,388 real changes made)

. replace gender = 0 if sexo == "2"
(563,590 real changes made)

. label define genderlbl 1 "Male" 0 "Female"

. label values gender genderlbl

. order gender, after(sexo)

. label variable gender "gender"

. label variable edad "age"

. order gender edad, after(time)

. drop sexo

. 
. *mother and father home
. gen motherhome = .
(1,180,978 missing values generated)

. replace motherhome = 1 if madre_hog == "1"
(424,375 real changes made)

. replace motherhome = 0 if madre_hog == "2"
(756,603 real changes made)

. label define motherlbl 1 "Yes" 0 "No"

. label values motherhome motherlbl

. order motherhome, after(madre_hog)

. label variable motherhome "lives with mother"

. drop madre_hog

. gen fatherhome = .
(1,180,978 missing values generated)

. replace fatherhome = 1 if padre_hog == "1"
(304,603 real changes made)

. replace fatherhome = 0 if padre_hog == "2"
(876,375 real changes made)

. label define fatherlbl 1 "Yes" 0 "No"

. label values fatherhome fatherlbl

. order fatherhome, before(motherhome)

. label variable fatherhome "lives with father"

. drop padre_hog

. 
. *indigenous language speaker
. gen indspeaker = .
(1,180,978 missing values generated)

. replace indspeaker = 1 if hablaind == "1"
(88,011 real changes made)

. replace indspeaker = 0 if hablaind == "2"
(1,074,996 real changes made)

. label define indspeakerlbl 1 "Yes" 0 "No"

. label values indspeaker indspeakerlbl

. order indspeaker, before(hablaind)

. label variable indspeaker "speaks indigenous language"

. drop hablaind

. 
. *indigenous language 
. rename lenguaind indlang

. label variable indlang "indigenous language spoken"

. destring indlang, replace
indlang: all characters numeric; replaced as int
(1092967 missing values generated)

. label define indlanglbl ///
>     111 "Paipai" ///
>     112 "Kiliwa" ///
>     115 "Kumiai" ///
>     131 "Chontal de Oaxaca" ///
>     200 "Chinanteco" ///
>     211 "Chinanteco de Ojitlán" ///
>     212 "Chinanteco de Usila" ///
>     222 "Chinanteco de Yolox" ///
>     223 "Chinanteco de Sochiapan" ///
>     231 "Chinanteco de Palantla" ///
>     232 "Chinanteco de Valle Nacional" ///
>     241 "Chinanteco de Lalana" ///
>     243 "Unknown" ///
>     311 "Pame" ///
>     321 "Chichimeca Jonaz" ///
>     331 "Otomí" ///
>     332 "Mazahua" ///
>     342 "Ocuilteco" ///
>     400 "Zapoteco" ///
>     411 "Zapoteco de Ixtlán" ///
>     412 "Zapoteco Vijano" ///
>     421 "Zapoteco Vallista" ///
>     422 "Zapoteco del Istmo" ///
>     431 "Zapoteco de Cuixtla" ///
>     432 "Solteco" ///
>     433 "Zapoteco Sureño" ///
>     441 "Chatino" ///
>     450 "Mixteco" ///
>     451 "Mixteco Zona Costa" ///
>     452 "Mixteco Zona Alta" ///
>     453 "Mixteco Zona Baja" ///
>     454 "Mixteco Zona Mazateca" ///
>     455 "Mixteco de Puebla" ///
>     456 "Tacuate" ///
>     461 "Cuicateco" ///
>     471 "Triqui" ///
>     481 "Amuzgo" ///
>     482 "Amuzgo de Guerrero" ///
>     483 "Amuzgo de Oaxaca" ///
>     491 "Mazateco" ///
>     493 "Ixcateco" ///
>     494 "Popoloca" ///
>     511 "Huave" ///
>     611 "Tlapaneco" ///
>     711 "Totonaca" ///
>     712 "Tepehua" ///
>     800 "Popoluca" ///
>     811 "Mixe" ///
>     812 "Popoluca de Oluta" ///
>     821 "Popoluca de la Sierra" ///
>     822 "Popoluca de Texistepec" ///
>     823 "Zoque" ///
>     911 "Huasteco" ///
>     921 "Lacandón" ///
>     922 "Maya" ///
>     931 "Ch'ol" ///
>     932 "Chontal de Tabasco" ///
>     933 "Tzeltal" ///
>     934 "Tzotzil" ///
>     935 "Tojolabal" ///
>     936 "Chuj" ///
>     941 "Mame" ///
>     942 "Ixil" ///
>     943 "Aguacateco" ///
>     951 "Motocintleco" ///
>     961 "Kanjobal" ///
>     971 "Quiché" ///
>     972 "Cakchiquel" ///
>     981 "Kekchi" ///
>     1011 "Pima" ///
>     1012 "Pápago" ///
>     1013 "Tepehuano" ///
>     1014 "Tepehuano del Norte" ///
>     1015 "Tepehuano del Sur" ///
>     1021 "Tarahumara" ///
>     1022 "Mayo" ///
>     1023 "Yaqui" ///
>     1024 "Guarijío" ///
>     1031 "Cora" ///
>     1032 "Huichol" ///
>     1041 "Náhuatl" ///
>     1111 "Purépecha" ///
>     1211 "Kikapú" ///
>     1311 "Chontal" ///
>     1999 "No especificado" ///
>     5024 "Chiapaneco" ///
>     5063 "Huzco" ///
>     5103 "Tehueco" ///
>     5501 "Añu" ///
>     5540 "Guajiro" ///
>     5571 "Pipil" ///
>     5595 "Wayuu"

. label values indlang indlanglbl

. 
. *understands indigenous language 
. gen indund = .
(1,180,978 missing values generated)

. replace indund = 1 if comprenind == "1"
(31,267 real changes made)

. replace indund = 0 if comprenind == "2"
(1,043,729 real changes made)

. label define indundlbl 0 "No" 1 "Yes"

. label values indund indundlbl

. order indund, before(comprenind)

. label variable indund "understands indigenous language"

. drop comprenind

. 
. *indigenous self-identification 
. gen indigenous = .
(1,180,978 missing values generated)

. replace indigenous = 1 if etnia == "1"
(379,588 real changes made)

. replace indigenous = 0 if etnia == "2"
(783,419 real changes made)

. label define indigenouslbl 0 "No" 1 "Yes"

. label values indigenous indigenouslbl

. order indigenous, before(etnia)

. label variable indigenous "indigenous self-identification"

. drop etnia

. 
. *school attendance
. gen school_attendance = .
(1,180,978 missing values generated)

. replace school_attendance = 1 if asis_esc == "1"
(248,628 real changes made)

. replace school_attendance = 0 if asis_esc == "2"
(914,379 real changes made)

. label define school_attendlbl 0 "No" 1 "Yes"

. label values school_attendance school_attendlbl

. order school_attendance, before(asis_esc)

. label variable school_attendance "school attendance"

. drop asis_esc

. 
. *years of school achieved
. *we assume that masters goes after a 5 year college education
. gen years_of_study = .
(1,180,978 missing values generated)

. replace years_of_study = 0 if nivelaprob == "0"
(67,886 real changes made)

. replace years_of_study = 0 if nivelaprob == "1"
(26,065 real changes made)

. replace years_of_study = 1 if nivelaprob == "2" & gradoaprob == "1"
(31,074 real changes made)

. replace years_of_study = 2 if nivelaprob == "2" & gradoaprob == "2"
(42,587 real changes made)

. replace years_of_study = 3 if nivelaprob == "2" & gradoaprob == "3"
(57,388 real changes made)

. replace years_of_study = 4 if nivelaprob == "2" & gradoaprob == "4"
(35,527 real changes made)

. replace years_of_study = 5 if nivelaprob == "2" & gradoaprob == "5"
(33,028 real changes made)

. replace years_of_study = 6 if nivelaprob == "2" & gradoaprob == "6"
(158,278 real changes made)

. replace years_of_study = 7 if nivelaprob == "3" & gradoaprob == "1"
(28,522 real changes made)

. replace years_of_study = 8 if nivelaprob == "3" & gradoaprob == "2"
(38,642 real changes made)

. replace years_of_study = 9 if nivelaprob == "3" & gradoaprob == "3"
(263,677 real changes made)

. replace years_of_study = 10 if nivelaprob == "4" & gradoaprob == "1"
(31,525 real changes made)

. replace years_of_study = 11 if nivelaprob == "4" & gradoaprob == "2"
(33,022 real changes made)

. replace years_of_study = 12 if nivelaprob == "4" & gradoaprob == "3"
(126,913 real changes made)

. replace years_of_study = 13 if nivelaprob == "5" & gradoaprob == "1"
(219 real changes made)

. replace years_of_study = 14 if nivelaprob == "5" & gradoaprob == "2"
(303 real changes made)

. replace years_of_study = 15 if nivelaprob == "5" & gradoaprob == "3"
(1,227 real changes made)

. replace years_of_study = 16 if nivelaprob == "5" & gradoaprob == "4"
(3,923 real changes made)

. replace years_of_study = 17 if nivelaprob == "5" & gradoaprob == "5"
(919 real changes made)

. replace years_of_study = 13 if nivelaprob == "6" & gradoaprob == "1"
(2,121 real changes made)

. replace years_of_study = 14 if nivelaprob == "6" & gradoaprob == "2"
(7,888 real changes made)

. replace years_of_study = 15 if nivelaprob == "6" & gradoaprob == "3"
(20,001 real changes made)

. replace years_of_study = 16 if nivelaprob == "6" & gradoaprob == "4"
(1,972 real changes made)

. replace years_of_study = 17 if nivelaprob == "6" & gradoaprob == "5"
(0 real changes made)

. replace years_of_study = 13 if nivelaprob == "7" & gradoaprob == "1"
(13,563 real changes made)

. replace years_of_study = 14 if nivelaprob == "7" & gradoaprob == "2"
(13,998 real changes made)

. replace years_of_study = 15 if nivelaprob == "7" & gradoaprob == "3"
(15,889 real changes made)

. replace years_of_study = 16 if nivelaprob == "7" & gradoaprob == "4"
(45,969 real changes made)

. replace years_of_study = 17 if nivelaprob == "7" & gradoaprob == "5"
(47,995 real changes made)

. replace years_of_study = 18 if nivelaprob == "8" & gradoaprob == "1"
(982 real changes made)

. replace years_of_study = 19 if nivelaprob == "8" & gradoaprob == "2"
(7,344 real changes made)

. replace years_of_study = 20 if nivelaprob == "8" & gradoaprob == "3"
(1,822 real changes made)

. replace years_of_study = 21 if nivelaprob == "9" & gradoaprob == "1"
(605 real changes made)

. replace years_of_study = 22 if nivelaprob == "9" & gradoaprob == "2"
(680 real changes made)

. replace years_of_study = 23 if nivelaprob == "9" & gradoaprob == "3"
(469 real changes made)

. replace years_of_study = 24 if nivelaprob == "9" & gradoaprob == "4"
(289 real changes made)

. replace years_of_study = 25 if nivelaprob == "9" & gradoaprob == "5"
(60 real changes made)

. label variable years_of_study "years of study"

. order years_of_study, after(school_attendance)

. drop nivelaprob gradoaprob

. 
. *generate state
. drop residencia

. gen state = substr(ubica_geo, 1, 2)

. destring state, replace
state: all characters numeric; replaced as byte

. label define states ///
>         1 "Aguascalientes" ///
>         2 "Baja California" ///
>         3 "Baja California Sur" ///
>         4 "Campeche" ///
>         5 "Coahuila" ///
>         6 "Colima" ///
>         7 "Chiapas" ///
>         8 "Chihuahua" ///
>         9 "Ciudad de México" ///
>         10 "Durango" ///
>         11 "Guanajuato" ///
>         12 "Guerrero" ///
>         13 "Hidalgo" ///
>         14 "Jalisco" ///
>         15 "México" ///
>         16 "Michoacán" ///
>         17 "Morelos" ///
>         18 "Nayarit" ///
>         19 "Nuevo León" ///
>         20 "Oaxaca" ///
>         21 "Puebla" ///
>         22 "Querétaro" ///
>         23 "Quintana Roo" ///
>         24 "San Luis Potosí" ///
>         25 "Sinaloa" ///
>         26 "Sonora" ///
>         27 "Tabasco" ///
>         28 "Tamaulipas" ///
>         29 "Tlaxcala" ///
>         30 "Veracruz" ///
>         31 "Yucatán" ///
>         32 "Zacatecas"

. 
. label values state states

. label variable state "state"

. label variable ubica_geo "municipality"

. label variable new_id "id"

. order ubica_geo state, after(new_id)

. 
. *work hours and employment dummy
. rename hor_1 hoursworked

. label variable hoursworked "hours worked per week"

. gen employed = .
(1,180,978 missing values generated)

. replace employed = 1 if trabajo_mp == "1"
(741,218 real changes made)

. replace employed = 0 if trabajo_mp == "2"
(309,498 real changes made)

. label define employedlbl 0 "No" 1 "Yes"

. label values employed employedlbl

. drop trabajo_mp

. label variable employed "employed previous month"

. drop folioviv

. 
. *income labels
. label variable ing_wages "wage income"

. label variable ing_non_wage_income "non wage labor income"

. label variable ing_gov_transfers "government transfer income"

. label variable ing_other "unclassified income"

. label variable ing_rentas "rental income"

. label variable ing_fin_capital "financial capital income"

. label variable ing_negocio "business income"

. label variable ing_ventas "sales income"

. 
. *clean id - we have 269,206 unique people in this dataset!
. egen dirty_id = group(new_id)

. gen id = dirty_id + 257805

. order id, before(new_id)

. drop dirty_id

. 
. *tempfile for append later
. tempfile enighdata2018

. save `enighdata2018'
file /var/folders/ym/ly4nlkxs5_3dmz2_2h7wxvr80000gn/T//St26292.000007 saved
    as .dta format

. 
. *************************************************
. ************** 2020 ENIGH dataset ***************
. *************************************************
. 
. ******** Poblacion and concentradohogar *********
. 
. use "../input/poblacion2020.dta", clear

. *use "$project/poblacion2020.dta", clear
. egen new_id = concat(folioviv foliohog numren)

. keep new_id hablaind lenguaind comprenind etnia sexo edad madre_hog padre_hog
>  asis_esc nivelaprob gradoaprob residencia hor_1 trabajo_mp 

. tempfile pop_data_2020

. save `pop_data_2020'
file /var/folders/ym/ly4nlkxs5_3dmz2_2h7wxvr80000gn/T//St26292.000008 saved
    as .dta format

. 
. use "../input/concentradohogar2020.dta", clear

. *use "$project/concentradohogar2020.dta", clear
. collapse (first) ubica_geo, by(folioviv)

. tempfile hog_data_2020

. save `hog_data_2020'
file /var/folders/ym/ly4nlkxs5_3dmz2_2h7wxvr80000gn/T//St26292.000009 saved
    as .dta format

. 
. ************ Ingresos ENIGH dataset *************
. 
. use "../input/ingresos2020.dta", clear

. *use "$project/ingresos2020.dta", clear
. egen new_id = concat(folioviv foliohog numren)

. 
. gen clave_group = ""
(394,912 missing values generated)

. 
. /*Wages*/
. replace clave_group = "wages" if inlist(clave, "P001", "P002", "P011", "P018"
> , "P019", "P067")
variable clave_group was str1 now str5
(105,036 real changes made)

. 
. /*Non Wage Labor Income*/
. replace clave_group = "non_wage_income" if inlist(clave, "P003", "P004", "P00
> 5", "P006", "P007", "P009")
variable clave_group was str5 now str15
(77,930 real changes made)

. replace clave_group = "non_wage_income" if inlist(clave, "P008","P014","P015"
> ,"P016")
(22,366 real changes made)

. 
. /*Government Transfers*/
. replace clave_group = "gov_transfers" if inlist(clave, "P032","P033","P038","
> P040","P042","P043","P044","P045") 
(48,079 real changes made)

. replace clave_group = "gov_transfers" if inlist(clave, "P048","P101","P046","
> P047","P102","P103")
(14,845 real changes made)

. replace clave_group = "gov_transfers" if inlist(clave, "P104","P105","P106","
> P107","P108")
(19,345 real changes made)

. 
. /*Other*/
. replace clave_group = "other" if inlist(clave, "P012","P013","P020","P021","P
> 022","P034","P035","P036","P037")
(26,246 real changes made)

. replace clave_group = "other" if inlist(clave, "P041","P049","P051","P057","P
> 058","P039")
(24,210 real changes made)

.         
. /*Rents*/
. replace clave_group = "rentas" if inlist(clave, "P023","P024","P025")
(3,601 real changes made)

. 
. /*Financial Capital*/
. replace clave_group = "fin_capital" if inlist(clave, "P026","P027","P028","P0
> 29","P030","P031","P050")
(827 real changes made)

. replace clave_group = "fin_capital" if inlist(clave, "P065","P066","P052","P0
> 53","P064")
(8,586 real changes made)

. 
. /*Business Income*/
. replace clave_group = "negocio" if inlist(clave, "P068","P069","P070","P071",
> "P072","P073","P074")  
(30,480 real changes made)

. replace clave_group = "negocio" if inlist(clave, "P078","P079","P080","P081",
> "P075","P076","P077")
(6,290 real changes made)

. 
. /*Sales*/
. replace clave_group = "ventas" if inlist(clave, "P054","P055","P056","P059","
> P060","P061","P062","P063")
(7,071 real changes made)

. 
. *Collapse income by our new six income classes
. collapse (sum) ing_1 ing_2 ing_3 ing_4 ing_5 ing_6 (first) mes_1 mes_2 mes_3 
> mes_4 mes_5 mes_6, by(new_id clave_group)

. 
. * Replace spaces with the value from the other row with the same new_id
. foreach mes in mes_1 mes_2 mes_3 mes_4 mes_5 mes_6 {
  2.     replace `mes' = `mes'[_n-1] if `mes' == " " & new_id == new_id[_n-1]
  3.     replace `mes' = `mes'[_n+1] if `mes' == " " & new_id == new_id[_n+1]
  4. }
(3,680 real changes made)
(28,353 real changes made)
(3,680 real changes made)
(28,353 real changes made)
(3,680 real changes made)
(28,353 real changes made)
(3,680 real changes made)
(28,353 real changes made)
(3,680 real changes made)
(28,353 real changes made)
(3,680 real changes made)
(28,353 real changes made)

. 
. *Create a panel dataset
. reshape long ing_, i(new_id clave_group) j(month)
(j = 1 2 3 4 5 6)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations          330,953   ->   1,985,718   
Number of variables                  14   ->   10          
j variable (6 values)                     ->   month
xij variables:
                  ing_1 ing_2 ... ing_6   ->   ing_
-----------------------------------------------------------------------------

. gen mes = ""
(1,985,718 missing values generated)

. 
. * Loop through the months and assign the value from mes_1, mes_2, mes_3...
. foreach m of numlist 1/6 {
  2.     replace mes = mes_`m' if month == `m'
  3. }
variable mes was str1 now str2
(330,953 real changes made)
(330,953 real changes made)
(330,953 real changes made)
(330,953 real changes made)
(330,953 real changes made)
(330,953 real changes made)

. 
. drop month mes_1 mes_2 mes_3 mes_4 mes_5

. 
. gen ing_wages = ing_ if clave_group == "wages"
(1,358,298 missing values generated)

. gen ing_non_wage_income = ing_ if clave_group == "non_wage_income"
(1,629,912 missing values generated)

. gen ing_fin_capital = ing_ if clave_group == "fin_capital"
(1,930,788 missing values generated)

. gen ing_gov_transfers = ing_ if clave_group == "gov_transfers"
(1,564,380 missing values generated)

. gen ing_negocio = ing_ if clave_group == "negocio"
(1,788,294 missing values generated)

. gen ing_other = ing_ if clave_group == "other"
(1,719,594 missing values generated)

. gen ing_rentas = ing_ if clave_group == "rentas"
(1,964,268 missing values generated)

. gen ing_ventas = ing_ if clave_group == "ventas"
(1,944,492 missing values generated)

. 
. collapse (max) ing_wages ing_non_wage_income ing_fin_capital ing_gov_transfer
> s ing_negocio ing_other ing_rentas ing_ventas, by(new_id mes mes_6)

. 
. *drop mes_6 (was our sanity check)
. drop mes_6

. 
. ************ Merge with previous datasets *************
. 
. merge m:1 new_id using `pop_data_2020'

    Result                      Number of obs
    -----------------------------------------
    Not matched                       111,411
        from master                         0  (_merge==1)
        from using                    111,411  (_merge==2)

    Matched                         1,225,886  (_merge==3)
    -----------------------------------------

. drop _merge

. gen folioviv = substr(new_id, 1, length(new_id) - 3)

. 
. merge m:1 folioviv using `hog_data_2020', keepusing(ubica_geo)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                         1,337,297  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. ************ Data cleanup for estimation *************
. 
. sort new_id mes

. 
. *generate date
. gen time = date("2020-" + mes, "YM")
(111,437 missing values generated)

. format time %td

. order time, after(mes)

. label variable time "month year date"

. drop mes

. 
. *generate gender
. gen gender = .
(1,337,297 missing values generated)

. replace gender = 1 if sexo == "1"
(705,695 real changes made)

. replace gender = 0 if sexo == "2"
(631,602 real changes made)

. label define genderlbl 1 "Male" 0 "Female"

. label values gender genderlbl

. order gender, after(sexo)

. label variable gender "gender"

. label variable edad "age"

. order gender edad, after(time)

. drop sexo

. 
. *mother and father home
. gen motherhome = .
(1,337,297 missing values generated)

. replace motherhome = 1 if madre_hog == "1"
(463,345 real changes made)

. replace motherhome = 0 if madre_hog == "2"
(873,952 real changes made)

. label define motherlbl 1 "Yes" 0 "No"

. label values motherhome motherlbl

. order motherhome, after(madre_hog)

. label variable motherhome "lives with mother"

. drop madre_hog

. gen fatherhome = .
(1,337,297 missing values generated)

. replace fatherhome = 1 if padre_hog == "1"
(323,489 real changes made)

. replace fatherhome = 0 if padre_hog == "2"
(1,013,808 real changes made)

. label define fatherlbl 1 "Yes" 0 "No"

. label values fatherhome fatherlbl

. order fatherhome, before(motherhome)

. label variable fatherhome "lives with father"

. drop padre_hog

. 
. *indigenous language speaker
. gen indspeaker = .
(1,337,297 missing values generated)

. replace indspeaker = 1 if hablaind == "1"
(92,088 real changes made)

. replace indspeaker = 0 if hablaind == "2"
(1,227,402 real changes made)

. label define indspeakerlbl 1 "Yes" 0 "No"

. label values indspeaker indspeakerlbl

. order indspeaker, before(hablaind)

. label variable indspeaker "speaks indigenous language"

. drop hablaind

. 
. *indigenous language 
. rename lenguaind indlang

. label variable indlang "indigenous language spoken"

. destring indlang, replace
indlang: all characters numeric; replaced as int
(1245209 missing values generated)

. label define indlanglbl ///
>     111 "Paipai" ///
>     112 "Kiliwa" ///
>     115 "Kumiai" ///
>     131 "Chontal de Oaxaca" ///
>     200 "Chinanteco" ///
>     211 "Chinanteco de Ojitlán" ///
>     212 "Chinanteco de Usila" ///
>     222 "Chinanteco de Yolox" ///
>     223 "Chinanteco de Sochiapan" ///
>     231 "Chinanteco de Palantla" ///
>     232 "Chinanteco de Valle Nacional" ///
>     241 "Chinanteco de Lalana" ///
>     243 "Unknown" ///
>     311 "Pame" ///
>     321 "Chichimeca Jonaz" ///
>     331 "Otomí" ///
>     332 "Mazahua" ///
>     342 "Ocuilteco" ///
>     400 "Zapoteco" ///
>     411 "Zapoteco de Ixtlán" ///
>     412 "Zapoteco Vijano" ///
>     421 "Zapoteco Vallista" ///
>     422 "Zapoteco del Istmo" ///
>     431 "Zapoteco de Cuixtla" ///
>     432 "Solteco" ///
>     433 "Zapoteco Sureño" ///
>     441 "Chatino" ///
>     450 "Mixteco" ///
>     451 "Mixteco Zona Costa" ///
>     452 "Mixteco Zona Alta" ///
>     453 "Mixteco Zona Baja" ///
>     454 "Mixteco Zona Mazateca" ///
>     455 "Mixteco de Puebla" ///
>     456 "Tacuate" ///
>     461 "Cuicateco" ///
>     471 "Triqui" ///
>     481 "Amuzgo" ///
>     482 "Amuzgo de Guerrero" ///
>     483 "Amuzgo de Oaxaca" ///
>     491 "Mazateco" ///
>     493 "Ixcateco" ///
>     494 "Popoloca" ///
>     511 "Huave" ///
>     611 "Tlapaneco" ///
>     711 "Totonaca" ///
>     712 "Tepehua" ///
>     800 "Popoluca" ///
>     811 "Mixe" ///
>     812 "Popoluca de Oluta" ///
>     821 "Popoluca de la Sierra" ///
>     822 "Popoluca de Texistepec" ///
>     823 "Zoque" ///
>     911 "Huasteco" ///
>     921 "Lacandón" ///
>     922 "Maya" ///
>     931 "Ch'ol" ///
>     932 "Chontal de Tabasco" ///
>     933 "Tzeltal" ///
>     934 "Tzotzil" ///
>     935 "Tojolabal" ///
>     936 "Chuj" ///
>     941 "Mame" ///
>     942 "Ixil" ///
>     943 "Aguacateco" ///
>     951 "Motocintleco" ///
>     961 "Kanjobal" ///
>     971 "Quiché" ///
>     972 "Cakchiquel" ///
>     981 "Kekchi" ///
>     1011 "Pima" ///
>     1012 "Pápago" ///
>     1013 "Tepehuano" ///
>     1014 "Tepehuano del Norte" ///
>     1015 "Tepehuano del Sur" ///
>     1021 "Tarahumara" ///
>     1022 "Mayo" ///
>     1023 "Yaqui" ///
>     1024 "Guarijío" ///
>     1031 "Cora" ///
>     1032 "Huichol" ///
>     1041 "Náhuatl" ///
>     1111 "Purépecha" ///
>     1211 "Kikapú" ///
>     1311 "Chontal" ///
>     1999 "No especificado" ///
>     5024 "Chiapaneco" ///
>     5063 "Huzco" ///
>     5103 "Tehueco" ///
>     5501 "Añu" ///
>     5540 "Guajiro" ///
>     5571 "Pipil" ///
>     5595 "Wayuu"

. label values indlang indlanglbl

. 
. *understands indigenous language 
. gen indund = .
(1,337,297 missing values generated)

. replace indund = 1 if comprenind == "1"
(34,213 real changes made)

. replace indund = 0 if comprenind == "2"
(1,193,189 real changes made)

. label define indundlbl 0 "No" 1 "Yes"

. label values indund indundlbl

. order indund, before(comprenind)

. label variable indund "understands indigenous language"

. drop comprenind

. 
. *indigenous self-identification 
. gen indigenous = .
(1,337,297 missing values generated)

. replace indigenous = 1 if etnia == "1"
(424,611 real changes made)

. replace indigenous = 0 if etnia == "2"
(894,879 real changes made)

. label define indigenouslbl 0 "No" 1 "Yes"

. label values indigenous indigenouslbl

. order indigenous, before(etnia)

. label variable indigenous "indigenous self-identification"

. drop etnia

. 
. *school attendance
. gen school_attendance = .
(1,337,297 missing values generated)

. replace school_attendance = 1 if asis_esc == "1"
(239,551 real changes made)

. replace school_attendance = 0 if asis_esc == "2"
(1,079,939 real changes made)

. label define school_attendlbl 0 "No" 1 "Yes"

. label values school_attendance school_attendlbl

. order school_attendance, before(asis_esc)

. label variable school_attendance "school attendance"

. drop asis_esc

. 
. *years of school achieved
. *we assume that masters goes after a 5 year college education
. gen years_of_study = .
(1,337,297 missing values generated)

. replace years_of_study = 0 if nivelaprob == "0"
(73,439 real changes made)

. replace years_of_study = 0 if nivelaprob == "1"
(23,591 real changes made)

. replace years_of_study = 1 if nivelaprob == "2" & gradoaprob == "1"
(30,175 real changes made)

. replace years_of_study = 2 if nivelaprob == "2" & gradoaprob == "2"
(43,071 real changes made)

. replace years_of_study = 3 if nivelaprob == "2" & gradoaprob == "3"
(59,022 real changes made)

. replace years_of_study = 4 if nivelaprob == "2" & gradoaprob == "4"
(33,200 real changes made)

. replace years_of_study = 5 if nivelaprob == "2" & gradoaprob == "5"
(30,071 real changes made)

. replace years_of_study = 6 if nivelaprob == "2" & gradoaprob == "6"
(173,464 real changes made)

. replace years_of_study = 7 if nivelaprob == "3" & gradoaprob == "1"
(27,244 real changes made)

. replace years_of_study = 8 if nivelaprob == "3" & gradoaprob == "2"
(38,560 real changes made)

. replace years_of_study = 9 if nivelaprob == "3" & gradoaprob == "3"
(297,588 real changes made)

. replace years_of_study = 10 if nivelaprob == "4" & gradoaprob == "1"
(40,373 real changes made)

. replace years_of_study = 11 if nivelaprob == "4" & gradoaprob == "2"
(42,074 real changes made)

. replace years_of_study = 12 if nivelaprob == "4" & gradoaprob == "3"
(164,049 real changes made)

. replace years_of_study = 13 if nivelaprob == "5" & gradoaprob == "1"
(324 real changes made)

. replace years_of_study = 14 if nivelaprob == "5" & gradoaprob == "2"
(433 real changes made)

. replace years_of_study = 15 if nivelaprob == "5" & gradoaprob == "3"
(1,535 real changes made)

. replace years_of_study = 16 if nivelaprob == "5" & gradoaprob == "4"
(4,877 real changes made)

. replace years_of_study = 17 if nivelaprob == "5" & gradoaprob == "5"
(1,153 real changes made)

. replace years_of_study = 13 if nivelaprob == "6" & gradoaprob == "1"
(2,660 real changes made)

. replace years_of_study = 14 if nivelaprob == "6" & gradoaprob == "2"
(10,064 real changes made)

. replace years_of_study = 15 if nivelaprob == "6" & gradoaprob == "3"
(23,894 real changes made)

. replace years_of_study = 16 if nivelaprob == "6" & gradoaprob == "4"
(2,471 real changes made)

. replace years_of_study = 17 if nivelaprob == "6" & gradoaprob == "5"
(0 real changes made)

. replace years_of_study = 13 if nivelaprob == "7" & gradoaprob == "1"
(17,908 real changes made)

. replace years_of_study = 14 if nivelaprob == "7" & gradoaprob == "2"
(17,716 real changes made)

. replace years_of_study = 15 if nivelaprob == "7" & gradoaprob == "3"
(21,959 real changes made)

. replace years_of_study = 16 if nivelaprob == "7" & gradoaprob == "4"
(61,817 real changes made)

. replace years_of_study = 17 if nivelaprob == "7" & gradoaprob == "5"
(59,121 real changes made)

. replace years_of_study = 18 if nivelaprob == "8" & gradoaprob == "1"
(1,327 real changes made)

. replace years_of_study = 19 if nivelaprob == "8" & gradoaprob == "2"
(9,911 real changes made)

. replace years_of_study = 20 if nivelaprob == "8" & gradoaprob == "3"
(2,439 real changes made)

. replace years_of_study = 21 if nivelaprob == "9" & gradoaprob == "1"
(877 real changes made)

. replace years_of_study = 22 if nivelaprob == "9" & gradoaprob == "2"
(911 real changes made)

. replace years_of_study = 23 if nivelaprob == "9" & gradoaprob == "3"
(739 real changes made)

. replace years_of_study = 24 if nivelaprob == "9" & gradoaprob == "4"
(464 real changes made)

. replace years_of_study = 25 if nivelaprob == "9" & gradoaprob == "5"
(157 real changes made)

. label variable years_of_study "years of study"

. order years_of_study, after(school_attendance)

. drop nivelaprob gradoaprob

. 
. *generate state
. drop residencia

. gen state = substr(ubica_geo, 1, 2)

. destring state, replace
state: all characters numeric; replaced as byte

. label define states ///
>         1 "Aguascalientes" ///
>         2 "Baja California" ///
>         3 "Baja California Sur" ///
>         4 "Campeche" ///
>         5 "Coahuila" ///
>         6 "Colima" ///
>         7 "Chiapas" ///
>         8 "Chihuahua" ///
>         9 "Ciudad de México" ///
>         10 "Durango" ///
>         11 "Guanajuato" ///
>         12 "Guerrero" ///
>         13 "Hidalgo" ///
>         14 "Jalisco" ///
>         15 "México" ///
>         16 "Michoacán" ///
>         17 "Morelos" ///
>         18 "Nayarit" ///
>         19 "Nuevo León" ///
>         20 "Oaxaca" ///
>         21 "Puebla" ///
>         22 "Querétaro" ///
>         23 "Quintana Roo" ///
>         24 "San Luis Potosí" ///
>         25 "Sinaloa" ///
>         26 "Sonora" ///
>         27 "Tabasco" ///
>         28 "Tamaulipas" ///
>         29 "Tlaxcala" ///
>         30 "Veracruz" ///
>         31 "Yucatán" ///
>         32 "Zacatecas"

. 
. label values state states

. label variable state "state"

. label variable ubica_geo "municipality"

. label variable new_id "id"

. order ubica_geo state, after(new_id)

. 
. *work hours and employment dummy
. rename hor_1 hoursworked

. label variable hoursworked "hours worked per week"

. gen employed = .
(1,337,297 missing values generated)

. replace employed = 1 if trabajo_mp == "1"
(850,635 real changes made)

. replace employed = 0 if trabajo_mp == "2"
(374,592 real changes made)

. label define employedlbl 0 "No" 1 "Yes"

. label values employed employedlbl

. drop trabajo_mp

. label variable employed "employed previous month"

. drop folioviv

. 
. *income labels
. label variable ing_wages "wage income"

. label variable ing_non_wage_income "non wage labor income"

. label variable ing_gov_transfers "government transfer income"

. label variable ing_other "unclassified income"

. label variable ing_rentas "rental income"

. label variable ing_fin_capital "financial capital income"

. label variable ing_negocio "business income"

. label variable ing_ventas "sales income"

. 
. *clean id - we have 315743 unique people in this dataset!
. egen dirty_id = group(new_id)

. gen id = dirty_id + 257805 + 269206

. order id, before(new_id)

. drop dirty_id

. 
. *tempfile for append later
. tempfile enighdata2020

. save `enighdata2020'
file /var/folders/ym/ly4nlkxs5_3dmz2_2h7wxvr80000gn/T//St26292.00000a saved
    as .dta format

. 
. 
. *************************************************
. ************** 2022 ENIGH dataset ***************
. *************************************************
. 
. ******** Poblacion and concentradohogar *********
. 
. use "../input/poblacion2022.dta", clear

. *use "$project/poblacion2022.dta", clear
. egen new_id = concat(folioviv foliohog numren)

. keep new_id hablaind lenguaind comprenind etnia sexo edad madre_hog padre_hog
>  asis_esc nivelaprob gradoaprob residencia hor_1 trabajo_mp 

. tempfile pop_data_2022

. save `pop_data_2022'
file /var/folders/ym/ly4nlkxs5_3dmz2_2h7wxvr80000gn/T//St26292.00000b saved
    as .dta format

. 
. use "../input/concentradohogar2022.dta", clear

. *use "$project/concentradohogar2022.dta", clear
. collapse (first) ubica_geo, by(folioviv)

. tempfile hog_data_2022

. save `hog_data_2022'
file /var/folders/ym/ly4nlkxs5_3dmz2_2h7wxvr80000gn/T//St26292.00000c saved
    as .dta format

. 
. ************ Ingresos ENIGH dataset *************
. 
. use "../input/ingresos2022.dta", clear

. *use "$project/ingresos2022.dta", clear
. egen new_id = concat(folioviv foliohog numren)

. 
. gen clave_group = ""
(397,182 missing values generated)

. 
. /*Wages*/
. replace clave_group = "wages" if inlist(clave, "P001", "P002", "P011", "P018"
> , "P019", "P067")
variable clave_group was str1 now str5
(110,402 real changes made)

. 
. /*Non Wage Labor Income*/
. replace clave_group = "non_wage_income" if inlist(clave, "P003", "P004", "P00
> 5", "P006", "P007", "P009")
variable clave_group was str5 now str15
(84,222 real changes made)

. replace clave_group = "non_wage_income" if inlist(clave, "P008","P014","P015"
> ,"P016")
(23,950 real changes made)

. 
. /*Government Transfers*/
. replace clave_group = "gov_transfers" if inlist(clave, "P032","P033","P038","
> P040","P042","P043","P044","P045") 
(45,981 real changes made)

. replace clave_group = "gov_transfers" if inlist(clave, "P048","P101","P046","
> P047","P102","P103")
(14,729 real changes made)

. replace clave_group = "gov_transfers" if inlist(clave, "P104","P105","P106","
> P107","P108")
(25,737 real changes made)

. 
. /*Other*/
. replace clave_group = "other" if inlist(clave, "P012","P013","P020","P021","P
> 022","P034","P035","P036","P037")
(21,939 real changes made)

. replace clave_group = "other" if inlist(clave, "P041","P049","P051","P057","P
> 058","P039")
(19,972 real changes made)

.         
. /*Rents*/
. replace clave_group = "rentas" if inlist(clave, "P023","P024","P025")
(3,532 real changes made)

. 
. /*Financial Capital*/
. replace clave_group = "fin_capital" if inlist(clave, "P026","P027","P028","P0
> 29","P030","P031","P050")
(806 real changes made)

. replace clave_group = "fin_capital" if inlist(clave, "P065","P066","P052","P0
> 53","P064")
(6,025 real changes made)

. 
. /*Business Income*/
. replace clave_group = "negocio" if inlist(clave, "P068","P069","P070","P071",
> "P072","P073","P074")  
(29,508 real changes made)

. replace clave_group = "negocio" if inlist(clave, "P078","P079","P080","P081",
> "P075","P076","P077")
(6,216 real changes made)

. 
. /*Sales*/
. replace clave_group = "ventas" if inlist(clave, "P054","P055","P056","P059","
> P060","P061","P062","P063")
(4,163 real changes made)

. 
. *Collapse income by our new six income classes
. collapse (sum) ing_1 ing_2 ing_3 ing_4 ing_5 ing_6 (first) mes_1 mes_2 mes_3 
> mes_4 mes_5 mes_6, by(new_id clave_group)

. 
. * Replace spaces with the value from the other row with the same new_id
. foreach mes in mes_1 mes_2 mes_3 mes_4 mes_5 mes_6 {
  2.     replace `mes' = `mes'[_n-1] if `mes' == " " & new_id == new_id[_n-1]
  3.     replace `mes' = `mes'[_n+1] if `mes' == " " & new_id == new_id[_n+1]
  4. }
(3,720 real changes made)
(28,917 real changes made)
(3,720 real changes made)
(28,917 real changes made)
(3,720 real changes made)
(28,917 real changes made)
(3,720 real changes made)
(28,917 real changes made)
(3,720 real changes made)
(28,917 real changes made)
(3,720 real changes made)
(28,917 real changes made)

. 
. *Create a panel dataset
. reshape long ing_, i(new_id clave_group) j(month)
(j = 1 2 3 4 5 6)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations          327,762   ->   1,966,572   
Number of variables                  14   ->   10          
j variable (6 values)                     ->   month
xij variables:
                  ing_1 ing_2 ... ing_6   ->   ing_
-----------------------------------------------------------------------------

. gen mes = ""
(1,966,572 missing values generated)

. 
. * Loop through the months and assign the value from mes_1, mes_2, mes_3...
. foreach m of numlist 1/6 {
  2.     replace mes = mes_`m' if month == `m'
  3. }
variable mes was str1 now str2
(327,762 real changes made)
(327,762 real changes made)
(327,762 real changes made)
(327,762 real changes made)
(327,762 real changes made)
(327,762 real changes made)

. 
. drop month mes_1 mes_2 mes_3 mes_4 mes_5

. 
. gen ing_wages = ing_ if clave_group == "wages"
(1,307,484 missing values generated)

. gen ing_non_wage_income = ing_ if clave_group == "non_wage_income"
(1,591,002 missing values generated)

. gen ing_fin_capital = ing_ if clave_group == "fin_capital"
(1,926,768 missing values generated)

. gen ing_gov_transfers = ing_ if clave_group == "gov_transfers"
(1,536,456 missing values generated)

. gen ing_negocio = ing_ if clave_group == "negocio"
(1,776,432 missing values generated)

. gen ing_other = ing_ if clave_group == "other"
(1,740,204 missing values generated)

. gen ing_rentas = ing_ if clave_group == "rentas"
(1,945,566 missing values generated)

. gen ing_ventas = ing_ if clave_group == "ventas"
(1,942,092 missing values generated)

. 
. collapse (max) ing_wages ing_non_wage_income ing_fin_capital ing_gov_transfer
> s ing_negocio ing_other ing_rentas ing_ventas, by(new_id mes mes_6)

. 
. *drop mes_6 (was our sanity check)
. drop mes_6

. 
. ************ Merge with previous datasets *************
. 
. merge m:1 new_id using `pop_data_2022'

    Result                      Number of obs
    -----------------------------------------
    Not matched                       104,540
        from master                         0  (_merge==1)
        from using                    104,540  (_merge==2)

    Matched                         1,230,843  (_merge==3)
    -----------------------------------------

. drop _merge

. gen folioviv = substr(new_id, 1, length(new_id) - 3)

. 
. merge m:1 folioviv using `hog_data_2022', keepusing(ubica_geo)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                         1,335,383  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. ************ Data cleanup for estimation *************
. 
. sort new_id mes

. 
. *generate date
. gen time = date("2022-" + mes, "YM")
(104,549 missing values generated)

. format time %td

. order time, after(mes)

. label variable time "month year date"

. drop mes

. 
. *generate gender
. gen gender = .
(1,335,383 missing values generated)

. replace gender = 1 if sexo == "1"
(691,643 real changes made)

. replace gender = 0 if sexo == "2"
(643,740 real changes made)

. label define genderlbl 1 "Male" 0 "Female"

. label values gender genderlbl

. order gender, after(sexo)

. label variable gender "gender"

. label variable edad "age"

. order gender edad, after(time)

. drop sexo

. 
. *mother and father home
. gen motherhome = .
(1,335,383 missing values generated)

. replace motherhome = 1 if madre_hog == "1"
(448,619 real changes made)

. replace motherhome = 0 if madre_hog == "2"
(886,764 real changes made)

. label define motherlbl 1 "Yes" 0 "No"

. label values motherhome motherlbl

. order motherhome, after(madre_hog)

. label variable motherhome "lives with mother"

. drop madre_hog

. gen fatherhome = .
(1,335,383 missing values generated)

. replace fatherhome = 1 if padre_hog == "1"
(300,797 real changes made)

. replace fatherhome = 0 if padre_hog == "2"
(1,034,586 real changes made)

. label define fatherlbl 1 "Yes" 0 "No"

. label values fatherhome fatherlbl

. order fatherhome, before(motherhome)

. label variable fatherhome "lives with father"

. drop padre_hog

. 
. *indigenous language speaker
. gen indspeaker = .
(1,335,383 missing values generated)

. replace indspeaker = 1 if hablaind == "1"
(96,106 real changes made)

. replace indspeaker = 0 if hablaind == "2"
(1,223,280 real changes made)

. label define indspeakerlbl 1 "Yes" 0 "No"

. label values indspeaker indspeakerlbl

. order indspeaker, before(hablaind)

. label variable indspeaker "speaks indigenous language"

. drop hablaind

. 
. *indigenous language
. *source for classification
. *https://www.inegi.org.mx/contenidos/productos/prod_serv/contenidos/espanol/b
> vinegi/productos/nueva_estruc/702825064617.pdf
. rename lenguaind indlang

. label variable indlang "indigenous language spoken"

. destring indlang, replace
indlang: all characters numeric; replaced as int
(1239277 missing values generated)

. label define indlanglbl ///
>     111 "Paipai" ///
>     112 "Kiliwa" ///
>     113 "Cucapá" ///
>     114 "Cochimí" ///
>     115 "Kumiai" ///
>     121 "Seri" ///
>     131 "Chontal de Oaxaca" ///
>     200 "Chinanteco" ///
>     211 "Chinanteco de Ojitlán" ///
>     212 "Chinanteco de Usila" ///
>     221 "Chinanteco de Quiotepec" ///
>     222 "Chinanteco de Yolox" ///
>     223 "Chinanteco de Sochiapan" ///
>     231 "Chinanteco de Palantla" ///
>     232 "Chinanteco de Valle Nacional" ///
>     241 "Chinanteco de Lalana" ///
>     243 "Unknown" ///
>     311 "Pame" ///
>     321 "Chichimeca Jonaz" ///
>     331 "Otomí" ///
>     332 "Mazahua" ///
>     341 "Matlatzinca" ///
>     342 "Ocuilteco" ///
>     400 "Zapoteco" ///
>     411 "Zapoteco de Ixtlán" ///
>     412 "Zapoteco Vijano" ///
>     413 "Zapoteco del Rincón" ///
>     421 "Zapoteco Vallista" ///
>     422 "Zapoteco del Istmo" ///
>     431 "Zapoteco de Cuixtla" ///
>     432 "Solteco" ///
>     433 "Zapoteco Sureño" ///
>     441 "Chatino" ///
>     450 "Mixteco" ///
>     451 "Mixteco Zona Costa" ///
>     452 "Mixteco Zona Alta" ///
>     453 "Mixteco Zona Baja" ///
>     454 "Mixteco Zona Mazateca" ///
>     455 "Mixteco de Puebla" ///
>     456 "Tacuate" ///
>     461 "Cuicateco" ///
>     471 "Triqui" ///
>     481 "Amuzgo" ///
>     482 "Amuzgo de Guerrero" ///
>     483 "Amuzgo de Oaxaca" ///
>     491 "Mazateco" ///
>     492 "Chocholteco" ///
>     493 "Ixcateco" ///
>     494 "Popoloca" ///
>     511 "Huave" ///
>     611 "Tlapaneco" ///
>     711 "Totonaca" ///
>     712 "Tepehua" ///
>     800 "Popoluca" ///
>     811 "Mixe" ///
>     812 "Popoluca de Oluta" ///
>     821 "Popoluca de la Sierra" ///
>     822 "Popoluca de Texistepec" ///
>     823 "Zoque" ///
>     824 "Ayapaneco" ///
>     911 "Huasteco" ///
>     921 "Lacandón" ///
>     922 "Maya" ///
>     931 "Ch'ol" ///
>     932 "Chontal de Tabasco" ///
>     933 "Tzeltal" ///
>     934 "Tzotzil" ///
>     935 "Tojolabal" ///
>     936 "Chuj" ///
>     941 "Mame" ///
>     942 "Ixil" ///
>     943 "Aguacateco" ///
>     951 "Motocintleco" ///
>     961 "Kanjobal" ///
>     962 "Jacalteco" ///
>     971 "Quiché" ///
>     972 "Cakchiquel" ///
>     981 "Kekchi" ///
>     1011 "Pima" ///
>     1012 "Pápago" ///
>     1013 "Tepehuano" ///
>     1014 "Tepehuano del Norte" ///
>     1015 "Tepehuano del Sur" ///
>     1021 "Tarahumara" ///
>     1022 "Mayo" ///
>     1023 "Yaqui" ///
>     1024 "Guarijío" ///
>     1031 "Cora" ///
>     1032 "Huichol" ///
>     1041 "Náhuatl" ///
>     1111 "Purépecha" ///
>     1211 "Kikapú" ///
>     1311 "Chontal" ///
>     1999 "Non Specified" ///
>     9999 "Non Specified" ///
>     5023 "Chapaneco" ///
>     5024 "Chiapaneco" ///
>     5025 "Chicomucelteco" ///
>     5050 "Guachichil" ///
>     5053 "Guaycura" ///
>     5063 "Huzco" ///
>     5098 "Teco" ///
>     5103 "Tehueco" ///
>     5501 "Añu" ///
>     5504 "Akatako" ///
>     5513 "Aymara" ///
>     5540 "Guajiro" ///
>     5544 "Guaymi" ///
>     5551 "Quechua" ///
>     5556 "Mayu" ///
>     5571 "Pipil" ///
>     5603 "Other American Languages" ///
>     5595 "Wayuu"

. label values indlang indlanglbl

. 
. *understands indigenous language 
. gen indund = .
(1,335,383 missing values generated)

. replace indund = 1 if comprenind == "1"
(33,603 real changes made)

. replace indund = 0 if comprenind == "2"
(1,189,677 real changes made)

. label define indundlbl 0 "No" 1 "Yes"

. label values indund indundlbl

. order indund, before(comprenind)

. label variable indund "understands indigenous language"

. drop comprenind

. 
. *indigenous self-identification 
. gen indigenous = .
(1,335,383 missing values generated)

. replace indigenous = 1 if etnia == "1"
(385,553 real changes made)

. replace indigenous = 0 if etnia == "2"
(933,833 real changes made)

. label define indigenouslbl 0 "No" 1 "Yes"

. label values indigenous indigenouslbl

. order indigenous, before(etnia)

. label variable indigenous "indigenous self-identification"

. drop etnia

. 
. *school attendance
. gen school_attendance = .
(1,335,383 missing values generated)

. replace school_attendance = 1 if asis_esc == "1"
(227,492 real changes made)

. replace school_attendance = 0 if asis_esc == "2"
(1,091,894 real changes made)

. label define school_attendlbl 0 "No" 1 "Yes"

. label values school_attendance school_attendlbl

. order school_attendance, before(asis_esc)

. label variable school_attendance "school attendance"

. drop asis_esc

. 
. *years of school achieved
. *we assume that masters goes after a 5 year college education
. gen years_of_study = .
(1,335,383 missing values generated)

. replace years_of_study = 0 if nivelaprob == "0"
(67,945 real changes made)

. replace years_of_study = 0 if nivelaprob == "1"
(23,830 real changes made)

. replace years_of_study = 1 if nivelaprob == "2" & gradoaprob == "1"
(26,776 real changes made)

. replace years_of_study = 2 if nivelaprob == "2" & gradoaprob == "2"
(39,616 real changes made)

. replace years_of_study = 3 if nivelaprob == "2" & gradoaprob == "3"
(55,345 real changes made)

. replace years_of_study = 4 if nivelaprob == "2" & gradoaprob == "4"
(32,288 real changes made)

. replace years_of_study = 5 if nivelaprob == "2" & gradoaprob == "5"
(28,153 real changes made)

. replace years_of_study = 6 if nivelaprob == "2" & gradoaprob == "6"
(170,232 real changes made)

. replace years_of_study = 7 if nivelaprob == "3" & gradoaprob == "1"
(25,160 real changes made)

. replace years_of_study = 8 if nivelaprob == "3" & gradoaprob == "2"
(35,997 real changes made)

. replace years_of_study = 9 if nivelaprob == "3" & gradoaprob == "3"
(302,230 real changes made)

. replace years_of_study = 10 if nivelaprob == "4" & gradoaprob == "1"
(36,305 real changes made)

. replace years_of_study = 11 if nivelaprob == "4" & gradoaprob == "2"
(40,908 real changes made)

. replace years_of_study = 12 if nivelaprob == "4" & gradoaprob == "3"
(178,087 real changes made)

. replace years_of_study = 13 if nivelaprob == "5" & gradoaprob == "1"
(393 real changes made)

. replace years_of_study = 14 if nivelaprob == "5" & gradoaprob == "2"
(553 real changes made)

. replace years_of_study = 15 if nivelaprob == "5" & gradoaprob == "3"
(1,603 real changes made)

. replace years_of_study = 16 if nivelaprob == "5" & gradoaprob == "4"
(4,429 real changes made)

. replace years_of_study = 17 if nivelaprob == "5" & gradoaprob == "5"
(1,220 real changes made)

. replace years_of_study = 13 if nivelaprob == "6" & gradoaprob == "1"
(2,406 real changes made)

. replace years_of_study = 14 if nivelaprob == "6" & gradoaprob == "2"
(8,731 real changes made)

. replace years_of_study = 15 if nivelaprob == "6" & gradoaprob == "3"
(23,413 real changes made)

. replace years_of_study = 16 if nivelaprob == "6" & gradoaprob == "4"
(2,545 real changes made)

. replace years_of_study = 17 if nivelaprob == "6" & gradoaprob == "5"
(0 real changes made)

. replace years_of_study = 13 if nivelaprob == "7" & gradoaprob == "1"
(16,149 real changes made)

. replace years_of_study = 14 if nivelaprob == "7" & gradoaprob == "2"
(17,030 real changes made)

. replace years_of_study = 15 if nivelaprob == "7" & gradoaprob == "3"
(23,091 real changes made)

. replace years_of_study = 16 if nivelaprob == "7" & gradoaprob == "4"
(66,648 real changes made)

. replace years_of_study = 17 if nivelaprob == "7" & gradoaprob == "5"
(70,078 real changes made)

. replace years_of_study = 18 if nivelaprob == "8" & gradoaprob == "1"
(1,300 real changes made)

. replace years_of_study = 19 if nivelaprob == "8" & gradoaprob == "2"
(9,840 real changes made)

. replace years_of_study = 20 if nivelaprob == "8" & gradoaprob == "3"
(2,960 real changes made)

. replace years_of_study = 21 if nivelaprob == "9" & gradoaprob == "1"
(731 real changes made)

. replace years_of_study = 22 if nivelaprob == "9" & gradoaprob == "2"
(932 real changes made)

. replace years_of_study = 23 if nivelaprob == "9" & gradoaprob == "3"
(874 real changes made)

. replace years_of_study = 24 if nivelaprob == "9" & gradoaprob == "4"
(474 real changes made)

. replace years_of_study = 25 if nivelaprob == "9" & gradoaprob == "5"
(258 real changes made)

. label variable years_of_study "years of study"

. order years_of_study, after(school_attendance)

. drop nivelaprob gradoaprob

. 
. *generate state
. drop residencia

. gen state = substr(ubica_geo, 1, 2)

. destring state, replace
state: all characters numeric; replaced as byte

. label define states ///
>         1 "Aguascalientes" ///
>         2 "Baja California" ///
>         3 "Baja California Sur" ///
>         4 "Campeche" ///
>         5 "Coahuila" ///
>         6 "Colima" ///
>         7 "Chiapas" ///
>         8 "Chihuahua" ///
>         9 "Ciudad de México" ///
>         10 "Durango" ///
>         11 "Guanajuato" ///
>         12 "Guerrero" ///
>         13 "Hidalgo" ///
>         14 "Jalisco" ///
>         15 "México" ///
>         16 "Michoacán" ///
>         17 "Morelos" ///
>         18 "Nayarit" ///
>         19 "Nuevo León" ///
>         20 "Oaxaca" ///
>         21 "Puebla" ///
>         22 "Querétaro" ///
>         23 "Quintana Roo" ///
>         24 "San Luis Potosí" ///
>         25 "Sinaloa" ///
>         26 "Sonora" ///
>         27 "Tabasco" ///
>         28 "Tamaulipas" ///
>         29 "Tlaxcala" ///
>         30 "Veracruz" ///
>         31 "Yucatán" ///
>         32 "Zacatecas"

. 
. label values state states

. label variable state "state"

. label variable ubica_geo "municipality"

. label variable new_id "id"

. order ubica_geo state, after(new_id)

. 
. *work hours and employment dummy
. rename hor_1 hoursworked

. label variable hoursworked "hours worked per week"

. gen employed = .
(1,335,383 missing values generated)

. replace employed = 1 if trabajo_mp == "1"
(873,503 real changes made)

. replace employed = 0 if trabajo_mp == "2"
(354,176 real changes made)

. label define employedlbl 0 "No" 1 "Yes"

. label values employed employedlbl

. drop trabajo_mp

. label variable employed "employed previous month"

. drop folioviv

. 
. *income labels
. label variable ing_wages "wage income"

. label variable ing_non_wage_income "non wage labor income"

. label variable ing_gov_transfers "government transfer income"

. label variable ing_other "unclassified income"

. label variable ing_rentas "rental income"

. label variable ing_fin_capital "financial capital income"

. label variable ing_negocio "business income"

. label variable ing_ventas "sales income"

. 
. *clean id - we have 309,684 unique people in this dataset!
. egen dirty_id = group(new_id)

. gen id = dirty_id + 257805 + 269206 + 315743

. order id, before(new_id)

. drop dirty_id

. 
. *tempfile for append later
. tempfile enighdata2022

. save `enighdata2022'
file /var/folders/ym/ly4nlkxs5_3dmz2_2h7wxvr80000gn/T//St26292.00000d saved
    as .dta format

. 
. *************************************************
. ********* Append 2016-18-20-22 dataset **********
. *************************************************
. 
. append using `enighdata2016' `enighdata2018' `enighdata2020'
(variable ubica_geo was str5, now str9 to accommodate using data's values)
(label employedlbl already defined)
(label states already defined)
(label school_attendlbl already defined)
(label indigenouslbl already defined)
(label indundlbl already defined)
(label indlanglbl already defined)
(label indspeakerlbl already defined)
(label fatherlbl already defined)
(label motherlbl already defined)
(label genderlbl already defined)
(label employedlbl already defined)
(label states already defined)
(label school_attendlbl already defined)
(label indigenouslbl already defined)
(label indundlbl already defined)
(label indlanglbl already defined)
(label indspeakerlbl already defined)
(label fatherlbl already defined)
(label motherlbl already defined)
(label genderlbl already defined)
(label employedlbl already defined)
(label states already defined)
(label school_attendlbl already defined)
(label indigenouslbl already defined)
(label indundlbl already defined)
(label indlanglbl already defined)
(label indspeakerlbl already defined)
(label fatherlbl already defined)
(label motherlbl already defined)
(label genderlbl already defined)

. sort id time

. merge m:1 time using `deflators'

    Result                      Number of obs
    -----------------------------------------
    Not matched                       385,665
        from master                   385,617  (_merge==1)
        from using                         48  (_merge==2)

    Matched                         4,601,004  (_merge==3)
    -----------------------------------------

. 
. *************************************************
. **************** New Variables ******************
. *************************************************
. 
. *destring ubica_geo
. destring ubica_geo, replace
ubica_geo: all characters numeric; replaced as int
(48 missing values generated)

. 
. *gen income variable
. egen ingreso = rowtotal(ing_wages ing_non_wage_income ing_fin_capital ing_gov
> _transfers ing_negocio ing_other ing_rentas ing_ventas)

. order ingreso, before(ing_wages)

. 
. *generate treatment
. gen zona_a = 0

. replace zona_a = 1 if ubica_geo == 02001 | ubica_geo == 02002 | ubica_geo == 
> 02003 | ubica_geo == 02004 | ubica_geo == 02005 | ubica_geo == 26055  | ubica
> _geo == 26048 | ubica_geo == 26070 | ubica_geo == 26017 | ubica_geo == 26004 
> | ubica_geo == 26060  | ubica_geo == 26043 | ubica_geo == 26059 | ubica_geo =
> = 26039 | ubica_geo == 26002 | ubica_geo == 08035  | ubica_geo == 08005 | ubi
> ca_geo == 08037 | ubica_geo == 08053 | ubica_geo == 08028 | ubica_geo == 0801
> 5  | ubica_geo == 08052 | ubica_geo == 08042 | ubica_geo == 05023 | ubica_geo
>  == 05002 | ubica_geo == 05038  | ubica_geo == 05014 | ubica_geo == 05022 | u
> bica_geo == 05025 | ubica_geo == 05012 | ubica_geo == 05013  | ubica_geo == 1
> 9005 | ubica_geo == 28027 | ubica_geo == 28014 | ubica_geo == 28024 | ubica_g
> eo == 28025  | ubica_geo == 28015 | ubica_geo == 28007 | ubica_geo == 28022 |
>  ubica_geo == 28032 | ubica_geo == 28033  | ubica_geo == 28040
(397,090 real changes made)

. 
. *generate log of income sources
. gen lni = ln(ingreso) if ingreso > 0
(1,111,050 missing values generated)

. gen lnw = ln(ing_wages) if ing_wages > 0
(2,885,002 missing values generated)

. gen lnnwi = ln(ing_non_wage_income) if ing_non_wage_income > 0
(4,404,004 missing values generated)

. gen lnfc = ln(ing_fin_capital) if ing_fin_capital > 0
(4,937,740 missing values generated)

. gen lngt = ln(ing_gov_transfers) if ing_gov_transfers > 0
(3,901,958 missing values generated)

. gen lnn = ln(ing_negocio) if ing_negocio > 0
(4,366,518 missing values generated)

. gen lno = ln(ing_other) if ing_other > 0
(4,499,507 missing values generated)

. gen lnr = ln(ing_rentas) if ing_rentas > 0
(4,922,725 missing values generated)

. gen lnv = ln(ing_ventas) if ing_ventas > 0
(4,961,507 missing values generated)

. 
. *************************************************
. **************** Sample Select ******************
. *************************************************
. 
. drop if time == .
(385,617 observations deleted)

. drop if edad <= 12
(351,000 observations deleted)

. gen edadsq = edad*edad
(48 missing values generated)

. 
. *save dataset
. save "../output/enighdata.dta", replace
file ../output/enighdata.dta saved

. *save "$output/enighdata.dta", replace
. 
. 
end of do-file
